{"id":399579,"page":1,"results":[{"author":"leeboardman","content":"James Cameron has spent more than a decade trying to bring Alita: Battle Angel to the big screen. Based on a popular cyberpunk manga series by Yukito Kishiro, published between 1990-1995, he has spent that time refining the script and developing the world that Alita inhabits. And that’s pretty much what he now spends most of his time taking care of with the Avatar movies and the world of Pandora. Hence the reason why he eventually decided to step back into producer duties for this movie, letting Robert Rodriguez pick up the directing reins in order to finally get it finished. Rodriguez uses much of the script that Cameron wrote, but brings a little bit of his trademark style to the table too.\r\n\r\nIt’s 2563, and we’re in Iron City. Dr Dyson Ido (Christoph Waltz) is scavenging among a huge scrapyard, looking for cyborg spare parts that he can make use of, while fresh metal and rubbish rains down from Zalem – a man-made, floating city sitting in the sky above Iron City. 300 years ago there were many of these floating cities but following a brutal war all of them except for Zalem perished. During that time though, the elevator leading up to Zalem was destroyed, and these days only the ‘pure’ inhabitants of Zalem are permitted there. Nobody from Earth is allowed to visit and if anyone comes down from Zalem, they’re not allowed back. It’s to try and avoid any contamination from entering Zalem. If you’ve seen the Matt Damon movie Elysium… well, then it’s a bit like that really.\r\n\r\n\r\nAmong the usual items, such as robotic hands and eyeballs, Dr Ido discovers Alita, or rather the core of Alita – lying lifeless and broken, with only a battered hairless head and upper torso remaining. He takes her back to his laboratory/home, where he works as a cybernetics expert, repairing and upgrading the inhabitants of Iron City who are either cyborgs or humans with cyborg body parts. Along with his assisting nurse, and using a robotic body that had been previously built for his now deceased daughter (this gets briefly explained later), they rebuild her, giving her the name Alita (also his daughters name). Alita awakens later in a nice comfortable bed, in what was presumably Dr Ido’s daughters room. She has no memory of her previous existence and sets about experiencing all the sights, sensations and tastes that human life and Iron City has to offer, exploring and striking up a friendship with local boy Hugo and his group of friends. But, as the name of the movie implies, this cyborg was built for battle, and it’s not long before Alita begins to remember who exactly she used to be and just how good at kicking ass she is.\r\n\r\n\r\nA quick word about the visuals, as they are by far the best thing about this movie. Iron City, despite clearly being a futuristic world, is certainly not dark or bleak looking in the way we’re used to with similar movies of this genre. Many of the early scenes take place during daylight hours and the city is a vibrant, bright, bustling home to thousand of humans and cyborgs. We get to go beyond the limits of Iron City – the city walls, out to the badlands beyond, and as you’d expect from Cameron a lot of thought and detail has gone into mapping out and building this world. The cyborgs and the other robots we meet are all pretty standard for a movie of this kind, but it’s Alita that is the most impressive. Much of this is down to the incredible CGI involved in making her look as realistic as she does, but a lot of what makes her so enjoyable and believable is down to Rosa Salazar, whose motion captured performance helps bring her to life. The visuals are obviously at their most impressive during the battle scenes involving Alita – where so many movies with heavy CGI battles end up as just a messy whirlpool of characters and action, that’s certainly not the case here. Slick, inventive and exhilarating choreography allowing you to actually track and follow every single character and action in crisp detail. It’s refreshing and impressive, even more so when watched in 3D and particularly so during the fast paced Motorball scenes featured towards the end of the movie.\r\n\r\nOutside of the visuals though, other characters and plot lines don’t seem to stick so well, which is disappointing considering the rich source material available to the film makers. Alita: Battle Angel suffers from inconsistent pacing, dialogue that is clunky and exposition-heavy and there are many times when the accompanying soundtrack just felt distracting to me, out of place with whatever is currently happening. Christoph Waltz, Mahershala Ali and Jennifer Connolly all seem overqualified and underutilised, and the romance between Alita and Hugo is unnecessary, and at times annoying. It feels like it’s trying to cram too much story into its two hour run time, resulting in plot holes and frustrations later on. And there is even a cliffhanger ending – frustrating in that it feels as though we haven’t even properly concluded this part of the story and we’re now being left to wait should a sequel ever be given the go ahead.\r\n\r\nI found much to enjoy with Alita: Battle Angel, and would gladly go see a sequel or two, should they get made. It’s enjoyable at times, and dazzling to look at, but overall it did leave me feeling a little bit frustrated and disappointed.","id":"5c5da23c0e0a2627a7671cb8","url":"https://www.themoviedb.org/review/5c5da23c0e0a2627a7671cb8"},{"author":"Per Gunnar Jonsson","content":"I quite enjoyed this movie. Of course it was a good start that it was directed by Robert Rodriguez.  It is perhaps a bit of a young adult movie but that did not stop this old fart from enjoying it.\r\n\r\nI guess most people know the basic premise of the movie. It is based on a Japanese cyberpunk manga. Alita, a cyborg, is found by Dr. Ido. She is reawakened, given a new body (two actually), she is much more than she seems and … she kicks ass.\r\n\r\nThe movie plays out in a somewhat post apocalyptic world although it is not as dark and depressing as many post apocalyptic scenarios. It is actually quite colorful and sometimes both funny and cool. A lot of people, if not most of them, in this world are cybernetically enhanced. Alita herself is a “full body conversion”. It is a quite detailed world full of pretty cool cyberpunk gadgets.\r\n\r\nThe various cyborgs themselves are of course the “main feature” of the movie. They range in a wide variety from fairly human-like to cyborg tanks. Most of them wielding various kinds of bladed weapons. Of course the CGI and the various action scenes are top notch. Alita is really cool when she gets going with her ass-kicking.\r\n\r\nStory? Well it is manga of course so it is pretty simple but having said that it’s not bad at all. I definitely feel there is some elements from Rollerball in the no rules racing and ball chasing games which is a centerpiece of the story.\r\n\r\nOne thing that I liked immensely is that there is really no preaching in this movie. No green nonsense and no social crap. Maybe that’s because it’s based on a Japanese manga and the Japanese has not yet developed the easily offended SJW mob that plagues all too many western countries nowadays. I know there’s a bunch of SJW retards that manages to cram some feminist message into it and another bunch that claims Alita is too pretty. Well if you like cyborgs with eyes like golf balls maybe but these asshats should perhaps stop their ranting and take a serious look at their sexual preferences in that case.\r\n\r\nThe only thing that I was not too happy about was that there is no real ending to it and what is there is rather sad. This Nova guy pulling the strings up in Zalem, the cloud city, is never even touched and the ending scenes just shows him smiling like a huge cliffhanger. I guess I should not be surprised because him and his cloud city is the foundation of this manga world so for the story to continue in a possible sequel that had to be kept but still … it irked me somewhat.","id":"5c72a7c69251415edfb36a5b","url":"https://www.themoviedb.org/review/5c72a7c69251415edfb36a5b"},{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI’m writing this review one day after the Oscars night, and I can guarantee at least one thing: Alita: Battle Angel is getting a Best Visual Effects nomination and it’s probably going to win. Calling it now. There are no words that can describe how immersive, realistic and groundbreaking the IMAX 3D experience is. Weta Digital is undoubtedly the most incredible VFX/CGI company since the beginning of this millennium. From the Lord of the Rings trilogy to the Avatar movie(s) and through the most famous TV series of this time, Game of Thrones, Peter Jackson‘s company keeps surpassing the impossible.\r\n\r\nAlita is a mix of Rosa Salazar‘s motion-capture performance and CGI animation, and it’s the most beautiful thing I’ve seen in a long time. Visuals are not the most important aspect of a film, they’re not even the key technical feature. The story and characters are and always will be the necessary ingredients for a movie’s success. That said, I’m also the first to defend that without remarkable technical achievements, a film won’t ever go above “very good.” If you want a movie to be one of the best of the year, a combination of compelling story/characters and great filmmaking attributes is essential. Robert Rodriguez‘s film nails the latter requirement, but has a lot of hits and misses regarding the former.\r\n\r\nLike I wrote above, I have no vocabulary to describe how mind-blowing and eyegasmic this movie looks. If you’re intrigued by how fascinated I am, you know what to do: buy an IMAX ticket and watch it. The visuals alone compensate for the price of admission. Besides the jaw-dropping VFX, the sound and production design are unbelievable. I could feel every punch, kick or scream like I rarely feel with other high-budget films. The amount of work that went in to build this world is worthy of recognition, and I honestly hope that by the end of this year, Alita is receiving a whole bunch of nominations for its aesthetics.\r\n\r\nI love how anime-like this feels. I didn’t read the original manga, but you will like this movie more if you’re a fan of anime. Rodriguez does a seamless job bringing Iron City to life, and there are tons of nods to how anime stories flow, which will surely please fans of said genre. Sadly, the screenplay isn’t exactly written as it should be. One of the most emotive moments of the film trusts the audience to buy into the romance displayed on-screen, but since it feels very forced from the get-go, this unnecessary subplot carries too much influence on the end result.\r\n\r\nIn addition to this, James Cameron and his team took a quite questionable decision concerning the main plot, having in mind the marketing surrounding this blockbuster. It’s still a minor spoiler, so I can’t really delve into details, but I’ll write this: the closest the movie gets to its third act, the more worried I became. From the moment the second acts ends, I start realizing something that not a single person working on this film even hinted at. And that was the worst call they could have ever made. Not only it dragged the first half of the movie, but it deeply damaged its narrative.\r\n\r\nOnce you see this film, you’ll understand what I’m talking about. You’ll get me when I say that the marketing strategy for Alita: Battle Angel ruined its story and it will definitely make a lot of people leave the theater frustrated, just like I did. Hopefully, this was just a misstep that doesn’t affect its box office because this is a movie worthy of watching at a movie theater and ONLY at such place. Yes, it does have issues with its storytelling. It has a whole world that doesn’t fit in just a 2-hour flick, so the plot becomes convoluted and a bit slow. However, I do think critics are being too harsh …\r\n\r\nAlita is one of the most complex, intriguing and well-written characters of the last few years. While the screenplay contains fundamental writing flaws, its main protagonist is flawless. Despite still feeling a bit frustrated, I want to rewatch this movie so bad, just to get another opportunity to follow Alita throughout her journey. I love character-driven narratives, especially when the character in question is such a compelling one. Rosa Salazar delivers an amazing mo-cap performance (The Academy wants a new category? Well, Best Motion-Capture Performance suits your ceremony like a glove). Alita and Salazar share resemblances that can only be achieved with the unique camera-setup and technology that the production team had at their display, which is something pretty outstanding.\r\n\r\nChristoph Waltz brilliantly portrays Ido, as expected from such a high-caliber actor. Mahershala Ali (Vector) and Jennifer Connelly (Chiren) are underused, but they make their characters work for the story. Keean Johnson is fine as Hugo, but he’s connected to one of the film’s major issues. Everyone else is pretty great, each performance elevates their respective character, which helps move the plot forward. However, it all goes back to Salazar‘s remarkable performance and the way she and Alita carried the whole thing to safe harbor. Hollywood, put your eyes on this girl!\r\n\r\nFinally, the action. Oh my God! The action scenes are some of the most entertaining, riveting and thrilling sequences I’ve seen since Mission: Impossible - Fallout. While the latter based its action on real jaw-dropping stunts, Alita: Battle Angel probably delivers some of the best animated action ever. The motorball sequences are impossible of getting your eyes off-screen, and the fights that Alita goes through are so well-crafted. Honestly, I’m even scared of how these look in regular 2D. I doubt they feel seamless and flow as perfect as they do in IMAX 3D, so be careful with which choice you make. In my opinion …\r\n\r\nAlita: Battle Angel is one of those movies that you HAVE TO watch at a movie theater, especially on IMAX 3D. You will not be able to grasp or feel the astonishingly immersive world that James Cameron produced, nor the powerful sound design. Its visuals effects are groundbreaking, and I promise you’ve never seen such a mixture of real and animation like this. Beautiful or gorgeous are not adjectives enough to describe the world where Alita lives. It’s a visual experience, so do waste your time and money in supporting this film.\r\n\r\nI can’t deny neither its storytelling problems or the damaging marketing surrounding this blockbuster. However, Rosa Salazar‘s terrific performance and Alita as the protagonist are more than enough reasons to make you feel entertained and captivated until the very end. The action is mind-blowing, and I’m not lying when I state that it contains some of the best animated sequences ever. I left the theater frustrated, but I can’t wait to see it again on the big screen. Alita alone deserves that effort.\r\n\r\nRating: B+","id":"5c741b630e0a262c1c81b465","url":"https://www.themoviedb.org/review/5c741b630e0a262c1c81b465"},{"author":"Gimly","content":"I did enjoy _Alita_. It was a great big \"pkyew-pkyew\" sort of a mess, but I did still walk away having had a pretty good time.\r\n\r\nUnfortunately, both Alita(the character)'s romantic interest and _Alita_(the movie)'s romantic plotline I despised. And this aspect took up **so much** on screen realestate that I could never see my way to giving _Alita_ a glowing score, even if everything else about it had been perfect (it wasn't).\r\n\r\nAn interesting part of the flim though that I also need to touch on is the special effects. They aren't even close to photorealism, but it honestly still totally works, just because there are so many of them. Impressive is the most appropriate word that comes to mind. See, even if the CGI effects don't always sell themselves as reality, the world that they are in fits, it's like how an animated movie doesn't look like real life, but you're still convinced because against its own backdrop, even though maybe they didn't use an actual elephant to play the role of Dumbo, you still believe that he's a real character **in that world**. _Alita's_ sheer abundance of creative, setting driven CGI, blurs the lines between live action and animation, delivering a totally new, unique product.\r\n\r\nIt's just a shame they couldn't have done that in a better, more coheseive (and less bogged down) narrative.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5c74d607925141688952dc52","url":"https://www.themoviedb.org/review/5c74d607925141688952dc52"},{"author":"tmdb44006625","content":"Definitely a Robert Rodriguez movie, but a Robert Rodriguez movie made with that James Cameron money.\r\n\r\nThe world building was incredible. Rosa Salazar, Christophe Waltz, and the rest of the cast do a great job. The technical wizardry, not just with the visual effects but the use of 3-D and IMAX was nothing short of dazzling. The action is exhilarating. I'll also take Motorball over podracing or Quidditch any day.\r\n\r\nYes there are problems with the script because James Cameron has never been a strong writer. There is also way too much sequel baiting for my taste. But for a movie like this to come out in a time when all the profitable IPs are getting tedious, Alita Battle Angel was refreshing and tons of fun. Easily the best live action anime film adaptation to date and a kick ass sensory overload.\r\n\r\nJames Cameron, I would rather you devote time to make more Battle Angel and less Avatar.","id":"5c842a3592514129191acea1","url":"https://www.themoviedb.org/review/5c842a3592514129191acea1"},{"author":"schezarde","content":"**Alita: Battle Angel** is an awesome movie. It has great action, an interesting plot, lovable characters, amazing acting by Rosa Salazar and overall it's a wonderful and fun film. It includes some of the best CGI ever created in film. Without a doubt, it is the best manga/anime adaption by Hollywood. I highly recommend this movie. Definitely 10 out of 10.","id":"5c86f1b7925141057a191c01","url":"https://www.themoviedb.org/review/5c86f1b7925141057a191c01"},{"author":"betty.vogl","content":"I'm truly disappointed by critics. I just don't understand their philosophy about entertainment. This movie was a marvelous! Without knowing the source material and <a href=\"http://quizlets.co/\">quizlet live</a>, it made me interested in this world. I can't wait for the next chapter.","id":"5c9a1487c3a36863b73c3b8b","url":"https://www.themoviedb.org/review/5c9a1487c3a36863b73c3b8b"},{"author":"E.J. Cummings","content":"**One not too terrible spoiler** This movie was full of potential. The beginning of the movie was fantastic, full of amazing James Cameronesque world building and attention to detail. Where the movie starts to go down hill is more of a suprise hole in the side walk that this movie fell down, because you don't see it coming. Up to and including the bar fight, the movie was amazing. RIGHT afterward the B team entered the cutting room floor, characters started doing things that went against their motivation, and honestly the least bit of work would have solved that, but none was put forward. It was like that for the entire last half of the movie. I DO hope there is a sequel, I would like to see that. I think it would be better.","id":"5cacc40d0e0a2679eda25e4a","url":"https://www.themoviedb.org/review/5cacc40d0e0a2679eda25e4a"}],"total_pages":1,"total_results":8}